# helper for strings

class Helper(object):
    HELP_M = '''```
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ
ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ
ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /```
'''
    HELP_ChatGPT = '''```
❖ ᴄʜᴧᴛɢᴘᴛ ᴄσϻϻᴧηᴅꜱ ❖```

**❖ ᴧɪ|ᴄʜᴧᴛɢᴘᴛ ᴄσϻϻᴧηᴅs

❍ /ai [ǫυєʀʏ] : sєᴧʀᴄʜ ᴛʜє ᴧηʏ ᴛʏᴘє ǫυєsᴛɪση
❍ /how [ǫυєʀʏ] : sєᴧʀᴄʜ ᴛʜє ᴧηʏ ᴛʏᴘє ǫυєsᴛɪση
❍ /ask ➠ ǫυєʀɪєs ᴛʜє ᴧɪ ϻσᴅєʟ ᴛσ ɢєᴛ ᴧ ʀєsᴘσηsє ᴛσ ʏσυʀ ǫυєsᴛɪση


❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''
    
    HELP_Q = '''```
❖ ǫυσᴛʟʏ ❖```

**ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴛʜє ǫυσᴛʟʏ ϻσᴅυʟє:

❍ /q : ᴄʀєᴧᴛє ᴧ ǫυσᴛє ғʀσϻ ᴛʜє ϻєssᴧɢє
❍ /q r : ᴄʀєᴧᴛє ᴧ ǫυσᴛє ғʀσϻ ᴛʜє ϻєssᴧɢє ᴡɪᴛʜ ʀєᴘʟʏ

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''
    
    HELP_Sticker = '''```
❖ sᴛɪᴄᴋєʀs ᴄσϻϻᴧηᴅꜱ ❖```

**❍ /packkang ➠ ᴄʀєᴧᴛєs ᴧ ᴘᴧᴄᴋ σғ sᴛɪᴄᴋєʀs ғʀσϻ ᴧ σᴛʜєʀ ᴘᴧᴄᴋ
❍ /stickerid ➠ ɢєᴛs ᴛʜє sᴛɪᴄᴋєʀ ɪᴅ σғ ᴧ sᴛɪᴄᴋєʀ

**❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''

    HELP_TagAll = '''```
❖ ᴛᴧɢ ᴄσϻϻᴧηᴅꜱ ❖```

**✿ ᴄʜσσsє ᴛᴧɢ ɪη ʏσυʀ ᴄʜᴧᴛ ✿

❍ /gmtag ➠ ɢσσᴅ ϻσʀηɪηɢ ᴡɪsʜ ᴛᴧɢ
❍ /gmstop ⇴ sᴛσᴘ ᴛᴧɢ 

❍ /gntag ➠ ɢσσᴅ ηɪɢʜᴛ ᴛᴧɢ 
❍ /gnstop ⇴ sᴛσᴘ ᴛᴧɢ

❍ /all ➠ ᴧηʏ ᴡʀɪᴛᴛєη ᴛєxᴛ ᴛᴧɢ
❍ /tagoff /tagstop ⇴ sᴛσᴘ ᴛᴧɢ

❍ /hitag ➠ ʀᴧηᴅσϻ ʜɪηᴅɪ ϻєssᴧɢє ᴛᴧɢ 
❍ /histop ⇴ sᴛσᴘ ᴛᴧɢ

❍ /shayari ➠ ʀᴧηᴅσϻ sʜᴧʏᴧʀɪ ᴛᴧɢ 
❍ /shstop ⇴ sᴛσᴘ ᴛᴧɢ


❍ /vctag ➠ ᴠσɪᴄє ᴄʜᴧᴛ ɪηᴠɪᴛє ᴛᴧɢ 
❍ /vcstop ⇴ sᴛσᴘ ᴛᴧɢ

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''

    HELP_Github = '''```
❖ ɢιτнυճ ᴄσϻϻᴧηᴅꜱ ❖```

**ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴛʜє ɠเƭɦµɓ ϻσᴅυʟє:

❍ /allrepo ➠ รεε αll ɾҽթօ αղվ ցเƭɦµɓ αccσµɳƭ ᴇx - /allrepo YOURTOOFAN.

❍ /github <ᴜsᴇʀɴᴀᴍᴇ> ➠ ɠεƭ เɳƒσɾɱαƭเσɳ αɓσµƭ α ɠเƭɦµɓ µรεɾ.

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''

    HELP_Group = '''```
❖ ɢɾσµρ ᴄσϻϻᴧηᴅꜱ ❖```

**❖ ɢяουρ мαиαgємєиτ ᴄσϻϻᴧηᴅs:

❍ /pin ➠ ᴘɪηs ᴧ ϻєssᴧɢє ɪη ᴛʜє ɢʀσυᴘ
❍ /pinned ➠ ᴅɪsᴘʟᴧʏs ᴛʜє ᴘɪηηєᴅ ϻєssᴧɢє ɪη ᴛʜє ɢʀσυᴘ
❍ /unpin ➠ υηᴘɪηs ᴛʜє ᴄυʀʀєηᴛʟʏ ᴘɪηηєᴅ ϻєssᴧɢє
❍ /staff ➠ ᴅɪsᴘʟᴧʏs ᴛʜє ʟɪsᴛ σғ sᴛᴧғғ ϻєϻʙєʀs
❍ /bots ➠ ᴅɪsᴘʟᴧʏs ᴛʜє ʟɪsᴛ σғ ʙσᴛs ɪη ᴛʜє ɢʀσυᴘ
❍ /settitle ➠ sєᴛs ᴛʜє ᴛɪᴛʟє σғ ᴛʜє ɢʀσυᴘ
❍ /setdiscription ➠ sєᴛs ᴛʜє ᴅєsᴄʀɪᴘᴛɪση σғ ᴛʜє ɢʀσυᴘ
❍ /setphoto ➠ sєᴛs ᴛʜє ɢʀσυᴘ ᴘʜσᴛσ
❍ /removephoto ➠ ʀєϻσᴠєs ᴛʜє ɢʀσυᴘ ᴘʜσᴛσ

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''

    HELP_Extra = '''```
❖ єxᴛʀᴧ ᴄσϻϻᴧηᴅꜱ ❖```

**❖ єxᴛʀᴧ ᴄσϻϻᴧηᴅs:

❍ /math ➠ sσʟᴠєs ϻᴧᴛʜєϻᴧᴛɪᴄᴧʟ ᴘʀσʙʟєϻs ᴧηᴅ ǫυᴧᴛɪσηs
❍ /tgm ➠ [ʀєᴘʟʏ ᴛσ ᴧηʏ ϻєᴅɪᴧ]
❍ /tr ➠ ᴄᴧη ᴛʀᴧηꜱʟᴧᴛє ϻυʟᴛɪᴘʟє ʟᴧηɢυᴧɢєs
❍ /google [ǫυєʀʏ] ➠ sєᴧʀᴄʜ ᴛʜє ɢσσɢʟє ғσʀ ᴛʜє ɢɪᴠєη ǫυєʀʏ
⦿ /gemini ➠ ᴀʙᴏᴜᴛ ᴀɴʏ ǫᴜᴇʀʏ ᴇx - /gemini lord ram.
⦿ /image ➠ ᴇx - /image lord ram ᴅᴏᴡɴʟᴏᴀᴅ ᴀɴʏ ɪᴍᴀɢᴇs.
⦿ /reel ➠ ᴅᴏᴡɴʟᴏᴀᴅ ɪɴsᴛᴀɢʀᴀᴍ ʀᴇᴇʟs ᴇx - /reel INSTAGRAM REEL LINK
⦿ /afk ➠  Wɪᴛʜ ᴛʜɪs ʏᴏᴜ ᴄᴀɴ sᴇᴇ ᴀғᴛᴇʀ ʜᴏᴡ ʟᴏɴɢ ʏᴏᴜ ᴀʀᴇ ᴄᴏᴍɪɴɢ ᴏɴʟɪɴᴇ.

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''

    HELP_Action = '''```
❖ ᴧϲτιοи ᴄσϻϻᴧηᴅꜱ ❖```

**❖ ᴧναɪʟᴧʙʟᴇ ᴄσϻϻᴧηᴅs բօя ϐαи & мυτє:

 ❍ /kickme: ᴋɪᴄᴋs ᴛʜє υsєʀ ᴡʜσ ɪssυєᴅ ᴛʜє ᴄσϻϻᴧηᴅ

Admins only:
❍ /ban <userhandle> : ʙᴧηs ᴧ υsєʀ. (ᴠɪᴧ ʜᴧηᴅʟє, σʀ ʀєᴘʟʏ)
❍ /sban <userhandle>: sɪʟєηᴛʟʏ ʙᴧη ᴧ υsєʀ ᴅєʟєᴛєs ᴄσϻϻᴧηᴅ, ʀєᴘʟɪєᴅ ϻєssᴧɢє ᴧηᴅ ᴅσєsη'ᴛ ʀєᴘʟʏ (ᴠɪᴧ ʜᴧηᴅʟє, σʀ ʀєᴘʟʏ)
❍ /tban <userhandle> : x(ϻ/ʜ/ᴅ): ʙᴧηs ᴧ υsєʀ ғσʀ x ᴛɪϻє (ᴠɪᴧ ʜᴧηᴅʟє, σʀ ʀєᴘʟʏ) ϻ = ϻɪηυᴛєs, ʜ = ʜσυʀs, ᴅ = ᴅᴧʏs
❍ /unban <userhandle> : υηʙᴧηs ᴧ υsєʀ (ᴠɪᴧ ʜᴧηᴅʟє, σʀ ʀєᴘʟʏ)
❍ /kick <userhandle> : ᴋɪᴄᴋs ᴧ υsєʀ συᴛ σғ ᴛʜє ɢʀσυᴘ, (ᴠɪᴧ ʜᴧηᴅʟє, σʀ ʀєᴘʟʏ)
❍ /mute <userhandle> : sɪʟєηᴄєs ᴧ υsєʀ ᴄᴧη ᴧʟsσ ʙє υsєᴅ ᴧs ᴧ ʀєᴘʟʏ, ϻυᴛɪηɢ ᴛʜє ʀєᴘʟɪєᴅ ᴛσ υsєʀ
❍ /tmute <userhandle> x(ϻ/ʜ/ᴅ): ϻυᴛєs ᴧ υsєʀ ғσʀ x ᴛɪϻє (ᴠɪᴧ ʜᴧηᴅʟє, σʀ ʀєᴘʟʏ). ϻ = ϻɪηυᴛєs, ʜ = ʜσυʀs, ᴅ = ᴅᴧʏs.
❍ /unmute <userhandle>: υηϻυᴛєs ᴧ υsєʀ ᴄᴧη ᴧʟsσ ʙє υsєᴅ ᴧs ᴧ ʀєᴘʟʏ, ϻυᴛɪηɢ ᴛʜє ʀєᴘʟɪєᴅ ᴛσ υsєʀ
__
𝐒ᴘᴇᴄɪᴀʟ 𝐂ᴏᴍᴍᴀɴᴅs 𝐒ᴜᴘᴘᴏʀᴛ 𝐀ʟʟ 𝐄xᴀᴍᴘʟᴇ  -  Purvi 𝚋𝚊𝚗  𝚖𝚞𝚝𝚎 Baby 𝚙𝚛𝚘𝚖𝚘𝚝𝚎 ..... 𝚎𝚝𝚌

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''

    HELP_Search = '''```
❖ sєᴧʀᴄʜ ᴄσϻϻᴧηᴅꜱ ❖```

❍ /google [ǫυєʀʏ] : sєᴧʀᴄʜ ᴛʜє ɢσσɢʟє ғσʀ ᴛʜє ɢɪᴠєη ǫυєʀʏ
❍ /anime [ǫυєʀʏ] : sєᴧʀᴄʜ ϻʏᴧηɪϻєʟɪsᴛ ғσʀ ᴛʜє ɢɪᴠєη ǫυєʀʏ
❍ /stack [ǫυєʀʏ] : sєᴧʀᴄʜ sᴛᴧᴄᴋσᴠєʀғʟσᴡ ғσʀ ᴛʜє ɢɪᴠєη ǫυєʀʏ
❍ /image (/imgs) [ǫυєʀʏ] : ɢєᴛ ᴛʜє ɪϻᴧɢєs ʀєɢᴧʀᴅɪηɢ ᴛσ ʏσυʀ ǫυєʀʏ**
```
❖ єxᴧϻᴘʟє : /google ᴘʏʀσɢʀᴧϻ : ʀєᴛυʀη ᴛσᴘ 5 ʀєυsʟᴛs ```

**❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''
    HELP_Promotion = '''Pʀᴏᴍᴏᴛɪᴏɴ

Pʀᴏᴍᴏᴛɪᴏɴ Dᴇᴛᴀɪʟ:

**─────────────────────────
ㅤㅤ❖ ᴘᴧɪᴅ ᴘʀσϻσᴛɪση ᴧᴠᴧɪʟᴧʙʟє ❖
─────────────────────────
❍ ᴄʜᴧᴛᴛɪηɢ ɢʀσυᴘ's
❍ ᴄσʟσʀ ᴛʀᴧᴅɪηɢ ɢᴧϻє's
❍ ᴄʜᴧηηєʟ's | ɢʀσυᴘ's .....
❍ ʙєᴛᴛɪηɢ ᴧᴅs σʀ ᴧηʏᴛʜɪηɢ
─────────────────────────
● ᴘʀσϻσᴛє ᴧηʏᴛʜɪηɢ ʏσυ ᴡᴧηᴛ 
    ση συʀ ᴘʟᴧᴛғσʀϻ ᴡɪᴛʜ ʙєsᴛ 
    ᴘʟᴧηs ᴧηᴅ ᴘʀσᴘєʀ sєʀᴠɪᴄєs
─────────────────────────
● ᴅᴧɪʟʏ . ᴡєєᴋʟʏ . ᴧηᴅ ϻσηᴛʜʟʏ ᴘʟᴧη'ꜱ 
   ᴧᴠᴧɪʟᴧʙʟє ꜰσʀ ʙɪɢ ʙυꜱɪηєꜱꜱєꜱ ᴧᴛ ᴛʜє
   ʙєꜱᴛ ᴘσꜱꜱɪʙʟє ᴄσηᴅɪᴛɪσηꜱ !
─────────────────────────
ʙєsᴛ ᴧηᴅ ᴄʜєᴧᴘ ɪη ᴛєʟєɢʀᴧϻ 400-500+
ϻєϻʙєʀs ɪη σηє ᴘʀσϻσᴛɪση ɢυʀᴧηᴛєє 
─────────────────────────
❍ ᴄσηᴛᴧᴄᴛ - [ɪsᴛᴋʜᴀʀ](https://t.me/THUNDERDEVS)
❍ ᴄσηᴛᴧᴄᴛ - [ᴛʜᴜɴᴅᴇʀ](https://t.me/ll_THUNDER_lll)
─────────────────────────**
'''
    HELP_Font = '''```
❖ ғσηᴛ ❖```
**ʙʏ υsɪηɢ ᴛʜɪs ϻσᴅυʟє ʏσυ ᴄᴧη ᴄʜᴧηɢє ғσηᴛs σғ ᴧηʏ ᴛєxᴛ!

❍ /font [ᴛєxᴛ]**
```
❖ єxᴧϻᴘʟє : /font istkhar op```

**❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''
    
    HELP_TG = '''```
❖ ᴛєʟєɢʀᴧᴘʜ ❖```
**ᴄʀєᴧᴛє ᴧ ᴛєʟєɢʀᴧᴘʜ ʟɪηᴋ ᴧηʏ ϻєᴅɪᴧ!

❍ /tgm [ʀєᴘʟʏ ᴛσ ᴧηʏ ϻєᴅɪᴧ]
❍ /tgt [ʀєᴘʟʏ ᴛσ ᴧηʏ ϻєᴅɪᴧ]

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''

    HELP_Couples = '''```
❖ cօυρℓєѕ ❖```

**нєяє ιѕ τнє нєℓρ ƒοя τня cօυρℓєѕ мο∂υℓє:

❍ /wish : ᴧᴅᴅ ʏσυʀ ᴡɪsʜ ᴧηᴅ sєє ɪᴛs ᴘσssɪʙɪʟɪᴛʏ!
❍ /love : ᴧᴅᴅ τοω иαмєѕ ᴧηᴅ sєє ʟᴏᴠᴇ ᴘᴏssɪʙɪʟɪᴛʏ! ʟɪᴋᴇ ᴛᴏsᴜ + ᴢᴏʏᴜ
❍ /couples : υѕє τнιѕ ᴄσϻϻᴧηᴅꜱ ᴧηᴅ sєє gяουρѕ ϲουρℓєѕ.

❖ ϻᴧᴅє ʙʏ  ➠ [⋆⎯꯭‌𝅃꯭᳚❤️‍🔥꯭⃕ ⃪꯭〬𐏓꯭𝐈꯭꯭ѕ꯭꯭፝֠֩‌тк꯭꯭н፝֠֩‌α꯭꯭я꯭꯭𝄄𝄀꯭𝄄꯭🔥꯭᪳𝆺꯭𝅥⎯‌꯭⟶⋆](https://t.me/THUNDERDEVS) **
'''
